    

Mock.mock(/.*?\/test\.html\?date=.*?/, function(){

    return '{"shiBie":[90000,287],"tuiSong":[70899,287,234],"chengXiao":[7899,287,234,90000],"echartDataQuestion":{"value":32.5,"name":"问题率1"},"ShuiWuJiGuan":[{"name":["北京1","上海","广东","浙江","天津","深圳","广西","湖南"],"TotalValue":[8000,45000,140000,180000,240000,160000,60000,90000],"recognizeValue":[7000,43000,100000,110000,200000,120000,30000,60000],"preCent":[30,60,80,78,70,68,98,70]},{"name":["北京2","上海","广东","浙江","天津","深圳","广西","湖南"],"TotalValue":[9000,46000,150000,190000,260000,180000,70000,100000],"recognizeValue":[7000,43000,100000,110000,200000,120000,30000,60000],"preCent":[30,60,80,78,70,68,98,70]}],"HangYe":[{"name":["北京3","上海","广东","浙江","天津","深圳","广西","湖南"],"TotalValue":[900,4600,15000,19000,26000,18000,7000,10000],"recognizeValue":[700,4300,10000,11000,20000,12000,3000,6000],"preCent":[30,60,80,78,70,68,98,70]},{"name":["北京4","上海","广东","浙江","天津","深圳","广西","湖南"],"TotalValue":[800,4500,14000,18000,24000,16000,6000,9000],"recognizeValue":[700,4300,10000,11000,20000,12000,3000,6000],"preCent":[30,60,80,78,70,68,98,70]}],"Mouth":[{"name":["201801","201802","201803","201804","201805","201806"],"TotalValue":[900,4600,15000,19000,26000,18000,7000,10000],"recognizeValue":[700,4300,10000,11000,20000,12000,3000,6000]},{"name":["201806","201802","201805","201804","201805","201803"],"TotalValue":[800,4500,14000,18000,24000,16000,6000,9000],"recognizeValue":[700,4300,10000,11000,20000,12000,3000,6000]}],"Content":[{"name":"一","type":"发票类","value":1234},{"name":"一二","type":"发票类","value":2345},{"name":"一二三","type":"发票类","value":3456},{"name":"一二三四","type":"发票类","value":4567},{"name":"一二三四五","type":"发票类","value":5678},{"name":"一二三四五六","type":"发票类","value":6789},{"name":"一二三四五六七","type":"发票类","value":7890},{"name":"一二三四五六七八","type":"发票类","value":8890},{"name":"9顶个开票","type":"发票类","value":9900},{"name":"10法定代表人年龄大于90","type":"发票类","value":9999},{"name":"11顶个开票","type":"发票类","value":12345},{"name":"12法定代表人年龄大于90","type":"发票类","value":23456}]}';
    
    /*
    retrun {
          "shiBie": [
            90000,
            287
          ],
          "tuiSong": [
            70899,
            287,
            234
          ],
          "chengXiao": [
            7899,
            287,
            234,
            90000
          ],
          "echartDataQuestion": {
            "value": 32,
            "name": "问题率1"
          },
          "ShuiWuJiGuan": [
            {
              "name": [
                "北京1",
                "上海",
                "广东",
                "浙江",
                "天津",
                "深圳",
                "广西",
                "湖南"
              ],
              "TotalValue": [
                8000,
                45000,
                140000,
                180000,
                240000,
                160000,
                60000,
                90000
              ],
              "recognizeValue": [
                7000,
                43000,
                100000,
                110000,
                200000,
                120000,
                30000,
                60000
              ],
              "preCent": [
                30,
                60,
                80,
                78,
                70,
                68,
                98,
                70
              ]
            },
            {
              "name": [
                "北京2",
                "上海",
                "广东",
                "浙江",
                "天津",
                "深圳",
                "广西",
                "湖南"
              ],
              "TotalValue": [
                9000,
                46000,
                150000,
                190000,
                260000,
                180000,
                70000,
                100000
              ],
              "recognizeValue": [
                7000,
                43000,
                100000,
                110000,
                200000,
                120000,
                30000,
                60000
              ],
              "preCent": [
                30,
                60,
                80,
                78,
                70,
                68,
                98,
                70
              ]
            }
          ],
          "HangYe": [
            {
              "name": [
                "北京3",
                "上海",
                "广东",
                "浙江",
                "天津",
                "深圳",
                "广西",
                "湖南"
              ],
              "TotalValue": [
                900,
                4600,
                15000,
                19000,
                26000,
                18000,
                7000,
                10000
              ],
              "recognizeValue": [
                700,
                4300,
                10000,
                11000,
                20000,
                12000,
                3000,
                6000
              ],
              "preCent": [
                30,
                60,
                80,
                78,
                70,
                68,
                98,
                70
              ]
            },
            {
              "name": [
                "北京4",
                "上海",
                "广东",
                "浙江",
                "天津",
                "深圳",
                "广西",
                "湖南"
              ],
              "TotalValue": [
                800,
                4500,
                14000,
                18000,
                24000,
                16000,
                6000,
                9000
              ],
              "recognizeValue": [
                700,
                4300,
                10000,
                11000,
                20000,
                12000,
                3000,
                6000
              ],
              "preCent": [
                30,
                60,
                80,
                78,
                70,
                68,
                98,
                70
              ]
            }
          ],
          "Mouth": [
            {
              "name": [
                "201801",
                "201802",
                "201803",
                "201804",
                "201805",
                "201806"
              ],
              "TotalValue": [
                900,
                4600,
                15000,
                19000,
                26000,
                18000,
                7000,
                10000
              ],
              "recognizeValue": [
                700,
                4300,
                10000,
                11000,
                20000,
                12000,
                3000,
                6000
              ]
            },
            {
              "name": [
                "201806",
                "201802",
                "201805",
                "201804",
                "201805",
                "201803"
              ],
              "TotalValue": [
                800,
                4500,
                14000,
                18000,
                24000,
                16000,
                6000,
                9000
              ],
              "recognizeValue": [
                700,
                4300,
                10000,
                11000,
                20000,
                12000,
                3000,
                6000
              ]
            }
          ],
          "Content": [
            {
              "name": "一",
              "type": "发票类",
              "value": 1234
            },
            {
              "name": "一二",
              "type": "发票类",
              "value": 2345
            },
            {
              "name": "一二三",
              "type": "发票类",
              "value": 3456
            },
            {
              "name": "一二三四",
              "type": "发票类",
              "value": 4567
            },
            {
              "name": "一二三四五",
              "type": "发票类",
              "value": 5678
            },
            {
              "name": "一二三四五六",
              "type": "发票类",
              "value": 6789
            },
            {
              "name": "一二三四五六七",
              "type": "发票类",
              "value": 7890
            },
            {
              "name": "一二三四五六七八",
              "type": "发票类",
              "value": 8890
            },
            {
              "name": "9顶个开票",
              "type": "发票类",
              "value": 9900
            },
            {
              "name": "10法定代表人年龄大于90",
              "type": "发票类",
              "value": 9999
            },
            {
              "name": "11顶个开票",
              "type": "发票类",
              "value": 12345
            },
            {
              "name": "12法定代表人年龄大于90",
              "type": "发票类",
              "value": 23456
            }
          ]
    }
    */
});

Mock.mock(/.*?\/test\.html\?date=2018-06-01.*?/, function(){

    return '{"shiBie":[90000,287],"tuiSong":[70899,287,234],"chengXiao":[7899,287,234,90000],"echartDataQuestion":{"value":32.5,"name":"问题率1"},"ShuiWuJiGuan":[{"name":["北京1","上海","广东","浙江","天津","深圳","广西","湖南"],"TotalValue":[8000,45000,140000,180000,240000,160000,60000,90000],"recognizeValue":[7000,43000,100000,110000,200000,120000,30000,60000],"preCent":[30,60,80,78,70,68,98,70]},{"name":["北京2","上海","广东","浙江","天津","深圳","广西","湖南"],"TotalValue":[9000,46000,150000,190000,260000,180000,70000,100000],"recognizeValue":[7000,43000,100000,110000,200000,120000,30000,60000],"preCent":[30,60,80,78,70,68,98,70]}],"HangYe":[{"name":["北京3","上海","广东","浙江","天津","深圳","广西","湖南"],"TotalValue":[900,4600,15000,19000,26000,18000,7000,10000],"recognizeValue":[700,4300,10000,11000,20000,12000,3000,6000],"preCent":[30,60,80,78,70,68,98,70]},{"name":["北京4","上海","广东","浙江","天津","深圳","广西","湖南"],"TotalValue":[800,4500,14000,18000,24000,16000,6000,9000],"recognizeValue":[700,4300,10000,11000,20000,12000,3000,6000],"preCent":[30,60,80,78,70,68,98,70]}],"Mouth":[{"name":["201801","201802","201803","201804","201805","201806"],"TotalValue":[900,4600,15000,19000,26000,18000,7000,10000],"recognizeValue":[700,4300,10000,11000,20000,12000,3000,6000]},{"name":["201806","201802","201805","201804","201805","201803"],"TotalValue":[800,4500,14000,18000,24000,16000,6000,9000],"recognizeValue":[700,4300,10000,11000,20000,12000,3000,6000]}],"Content":[{"name":"一","type":"发票类","value":1234},{"name":"一二","type":"发票类","value":2345},{"name":"一二三","type":"发票类","value":3456},{"name":"一二三四","type":"发票类","value":4567},{"name":"一二三四五","type":"发票类","value":5678},{"name":"一二三四五六","type":"发票类","value":6789},{"name":"一二三四五六七","type":"发票类","value":7890},{"name":"一二三四五六七八","type":"发票类","value":8890},{"name":"9顶个开票","type":"发票类","value":9900},{"name":"10法定代表人年龄大于90","type":"发票类","value":9999},{"name":"11顶个开票","type":"发票类","value":12345},{"name":"12法定代表人年龄大于90","type":"发票类","value":23456}]}';
    
    /*
    retrun {
          "shiBie": [
            90000,
            287
          ],
          "tuiSong": [
            70899,
            287,
            234
          ],
          "chengXiao": [
            7899,
            287,
            234,
            90000
          ],
          "echartDataQuestion": {
            "value": 32,
            "name": "问题率1"
          },
          "ShuiWuJiGuan": [
            {
              "name": [
                "北京1",
                "上海",
                "广东",
                "浙江",
                "天津",
                "深圳",
                "广西",
                "湖南"
              ],
              "TotalValue": [
                8000,
                45000,
                140000,
                180000,
                240000,
                160000,
                60000,
                90000
              ],
              "recognizeValue": [
                7000,
                43000,
                100000,
                110000,
                200000,
                120000,
                30000,
                60000
              ],
              "preCent": [
                30,
                60,
                80,
                78,
                70,
                68,
                98,
                70
              ]
            },
            {
              "name": [
                "北京2",
                "上海",
                "广东",
                "浙江",
                "天津",
                "深圳",
                "广西",
                "湖南"
              ],
              "TotalValue": [
                9000,
                46000,
                150000,
                190000,
                260000,
                180000,
                70000,
                100000
              ],
              "recognizeValue": [
                7000,
                43000,
                100000,
                110000,
                200000,
                120000,
                30000,
                60000
              ],
              "preCent": [
                30,
                60,
                80,
                78,
                70,
                68,
                98,
                70
              ]
            }
          ],
          "HangYe": [
            {
              "name": [
                "北京3",
                "上海",
                "广东",
                "浙江",
                "天津",
                "深圳",
                "广西",
                "湖南"
              ],
              "TotalValue": [
                900,
                4600,
                15000,
                19000,
                26000,
                18000,
                7000,
                10000
              ],
              "recognizeValue": [
                700,
                4300,
                10000,
                11000,
                20000,
                12000,
                3000,
                6000
              ],
              "preCent": [
                30,
                60,
                80,
                78,
                70,
                68,
                98,
                70
              ]
            },
            {
              "name": [
                "北京4",
                "上海",
                "广东",
                "浙江",
                "天津",
                "深圳",
                "广西",
                "湖南"
              ],
              "TotalValue": [
                800,
                4500,
                14000,
                18000,
                24000,
                16000,
                6000,
                9000
              ],
              "recognizeValue": [
                700,
                4300,
                10000,
                11000,
                20000,
                12000,
                3000,
                6000
              ],
              "preCent": [
                30,
                60,
                80,
                78,
                70,
                68,
                98,
                70
              ]
            }
          ],
          "Mouth": [
            {
              "name": [
                "201801",
                "201802",
                "201803",
                "201804",
                "201805",
                "201806"
              ],
              "TotalValue": [
                900,
                4600,
                15000,
                19000,
                26000,
                18000,
                7000,
                10000
              ],
              "recognizeValue": [
                700,
                4300,
                10000,
                11000,
                20000,
                12000,
                3000,
                6000
              ]
            },
            {
              "name": [
                "201806",
                "201802",
                "201805",
                "201804",
                "201805",
                "201803"
              ],
              "TotalValue": [
                800,
                4500,
                14000,
                18000,
                24000,
                16000,
                6000,
                9000
              ],
              "recognizeValue": [
                700,
                4300,
                10000,
                11000,
                20000,
                12000,
                3000,
                6000
              ]
            }
          ],
          "Content": [
            {
              "name": "一",
              "type": "发票类",
              "value": 1234
            },
            {
              "name": "一二",
              "type": "发票类",
              "value": 2345
            },
            {
              "name": "一二三",
              "type": "发票类",
              "value": 3456
            },
            {
              "name": "一二三四",
              "type": "发票类",
              "value": 4567
            },
            {
              "name": "一二三四五",
              "type": "发票类",
              "value": 5678
            },
            {
              "name": "一二三四五六",
              "type": "发票类",
              "value": 6789
            },
            {
              "name": "一二三四五六七",
              "type": "发票类",
              "value": 7890
            },
            {
              "name": "一二三四五六七八",
              "type": "发票类",
              "value": 8890
            },
            {
              "name": "9顶个开票",
              "type": "发票类",
              "value": 9900
            },
            {
              "name": "10法定代表人年龄大于90",
              "type": "发票类",
              "value": 9999
            },
            {
              "name": "11顶个开票",
              "type": "发票类",
              "value": 12345
            },
            {
              "name": "12法定代表人年龄大于90",
              "type": "发票类",
              "value": 23456
            }
          ]
    }
    */
});

Mock.mock(/.*?\/test\.html\?date=2018-06-02.*?/, function(){

    return '{"shiBie":[8000,287],"tuiSong":[23444,287,234],"chengXiao":[889,287,234,90000],"echartDataQuestion":{"value":82,"name":"问题率1"},"ShuiWuJiGuan":[{"name":["111","上海","广东","浙江","天津","深圳","广西","湖南"],"TotalValue":[8000,45000,140000,180000,240000,160000,60000,90000],"recognizeValue":[7000,43000,100000,110000,200000,120000,30000,60000],"preCent":[30,60,80,78,70,68,98,70]},{"name":["2222","上海","广东","浙江","天津","深圳","广西","湖南"],"TotalValue":[9000,46000,150000,190000,260000,180000,70000,100000],"recognizeValue":[7000,43000,100000,110000,200000,120000,30000,60000],"preCent":[30,60,80,78,70,68,98,70]}],"HangYe":[{"name":["3333","上海","广东","浙江","天津","深圳","广西","湖南"],"TotalValue":[900,4600,15000,19000,26000,18000,7000,10000],"recognizeValue":[700,4300,10000,11000,20000,12000,3000,6000],"preCent":[30,60,80,78,70,68,98,70]},{"name":["4444","上海","广东","浙江","天津","深圳","广西","湖南"],"TotalValue":[800,4500,14000,18000,24000,16000,6000,9000],"recognizeValue":[700,4300,10000,11000,20000,12000,3000,6000],"preCent":[30,60,80,78,70,68,98,70]}],"Mouth":[{"name":["5555","201802","201803","201804","201805","201806"],"TotalValue":[900,4600,15000,19000,26000,18000,7000,10000],"recognizeValue":[700,4300,10000,11000,20000,12000,3000,6000]},{"name":["6666","201802","201805","201804","201805","201803"],"TotalValue":[800,4500,14000,18000,24000,16000,6000,9000],"recognizeValue":[700,4300,10000,11000,20000,12000,3000,6000]}],"Content":[{"name":"7777","type":"发票类","value":1234},{"name":"8888","type":"发票类","value":2345},{"name":"一二三","type":"发票类","value":3456},{"name":"一二三四","type":"发票类","value":4567},{"name":"一二三四五","type":"发票类","value":5678},{"name":"一二三四五六","type":"发票类","value":6789},{"name":"一二三四五六七","type":"发票类","value":7890},{"name":"一二三四五六七八","type":"发票类","value":8890},{"name":"9顶个开票","type":"发票类","value":9900},{"name":"10法定代表人年龄大于90","type":"发票类","value":9999},{"name":"11顶个开票","type":"发票类","value":12345},{"name":"12法定代表人年龄大于90","type":"发票类","value":23456}]}';
    /*
    return {
          "shiBie": [
            8000,
            287
          ],
          "tuiSong": [
            23444,
            287,
            234
          ],
          "chengXiao": [
            889,
            287,
            234,
            90000
          ],
          "echartDataQuestion": {
            "value": 82,
            "name": "问题率1"
          },
          "ShuiWuJiGuan": [
            {
              "name": [
                "111",
                "上海",
                "广东",
                "浙江",
                "天津",
                "深圳",
                "广西",
                "湖南"
              ],
              "TotalValue": [
                8000,
                45000,
                140000,
                180000,
                240000,
                160000,
                60000,
                90000
              ],
              "recognizeValue": [
                7000,
                43000,
                100000,
                110000,
                200000,
                120000,
                30000,
                60000
              ],
              "preCent": [
                30,
                60,
                80,
                78,
                70,
                68,
                98,
                70
              ]
            },
            {
              "name": [
                "2222",
                "上海",
                "广东",
                "浙江",
                "天津",
                "深圳",
                "广西",
                "湖南"
              ],
              "TotalValue": [
                9000,
                46000,
                150000,
                190000,
                260000,
                180000,
                70000,
                100000
              ],
              "recognizeValue": [
                7000,
                43000,
                100000,
                110000,
                200000,
                120000,
                30000,
                60000
              ],
              "preCent": [
                30,
                60,
                80,
                78,
                70,
                68,
                98,
                70
              ]
            }
          ],
          "HangYe": [
            {
              "name": [
                "3333",
                "上海",
                "广东",
                "浙江",
                "天津",
                "深圳",
                "广西",
                "湖南"
              ],
              "TotalValue": [
                900,
                4600,
                15000,
                19000,
                26000,
                18000,
                7000,
                10000
              ],
              "recognizeValue": [
                700,
                4300,
                10000,
                11000,
                20000,
                12000,
                3000,
                6000
              ],
              "preCent": [
                30,
                60,
                80,
                78,
                70,
                68,
                98,
                70
              ]
            },
            {
              "name": [
                "4444",
                "上海",
                "广东",
                "浙江",
                "天津",
                "深圳",
                "广西",
                "湖南"
              ],
              "TotalValue": [
                800,
                4500,
                14000,
                18000,
                24000,
                16000,
                6000,
                9000
              ],
              "recognizeValue": [
                700,
                4300,
                10000,
                11000,
                20000,
                12000,
                3000,
                6000
              ],
              "preCent": [
                30,
                60,
                80,
                78,
                70,
                68,
                98,
                70
              ]
            }
          ],
          "Mouth": [
            {
              "name": [
                "5555",
                "201802",
                "201803",
                "201804",
                "201805",
                "201806"
              ],
              "TotalValue": [
                900,
                4600,
                15000,
                19000,
                26000,
                18000,
                7000,
                10000
              ],
              "recognizeValue": [
                700,
                4300,
                10000,
                11000,
                20000,
                12000,
                3000,
                6000
              ]
            },
            {
              "name": [
                "6666",
                "201802",
                "201805",
                "201804",
                "201805",
                "201803"
              ],
              "TotalValue": [
                800,
                4500,
                14000,
                18000,
                24000,
                16000,
                6000,
                9000
              ],
              "recognizeValue": [
                700,
                4300,
                10000,
                11000,
                20000,
                12000,
                3000,
                6000
              ]
            }
          ],
          "Content": [
            {
              "name": "7777",
              "type": "发票类",
              "value": 1234
            },
            {
              "name": "8888",
              "type": "发票类",
              "value": 2345
            },
            {
              "name": "一二三",
              "type": "发票类",
              "value": 3456
            },
            {
              "name": "一二三四",
              "type": "发票类",
              "value": 4567
            },
            {
              "name": "一二三四五",
              "type": "发票类",
              "value": 5678
            },
            {
              "name": "一二三四五六",
              "type": "发票类",
              "value": 6789
            },
            {
              "name": "一二三四五六七",
              "type": "发票类",
              "value": 7890
            },
            {
              "name": "一二三四五六七八",
              "type": "发票类",
              "value": 8890
            },
            {
              "name": "9顶个开票",
              "type": "发票类",
              "value": 9900
            },
            {
              "name": "10法定代表人年龄大于90",
              "type": "发票类",
              "value": 9999
            },
            {
              "name": "11顶个开票",
              "type": "发票类",
              "value": 12345
            },
            {
              "name": "12法定代表人年龄大于90",
              "type": "发票类",
              "value": 23456
            }
          ]
        };
    */
});
